In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("missing_values.csv")
df.head()

    Age  Score  Rank
0   NaN   19.0  91.0
1   NaN    NaN   NaN
2   NaN   63.0  97.0
3   NaN   48.0   NaN
4  86.0   47.0   7.0

In [4]:
# drop all the missing values from the entire dataframe
df.dropna()

    Age  Score  Rank
4  86.0   47.0   7.0

In [5]:
# drop missing values from columns. If any column has even a single missing value drop that column
df.dropna(axis=1)

# by default axis = 0 for rows and axis = 1 for columns

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [6]:
# since all the columns have some missing values so entire dataframe is actually dropped

In [7]:
# threshold = we are saying we want to drop any rows that have atleast non missing values
df.dropna(thresh=2)

    Age  Score  Rank
0   NaN   19.0  91.0
2   NaN   63.0  97.0
4  86.0   47.0   7.0

In [9]:
# fill missing values
df.fillna(value=100)

# this impute 100 in every place where the data is missing

     Age  Score   Rank
0  100.0   19.0   91.0
1  100.0  100.0  100.0
2  100.0   63.0   97.0
3  100.0   48.0  100.0
4   86.0   47.0    7.0

In [10]:
# we can even impute the missing value with mean value
df.fillna(df.mean())

    Age  Score  Rank
0  86.0  19.00  91.0
1  86.0  44.25  65.0
2  86.0  63.00  97.0
3  86.0  48.00  65.0
4  86.0  47.00   7.0